"Western (Mac OS Roman)" = "西方語系（Mac OS Roman）";
"Japanese (Mac OS)" = "日文（Mac OS）";
"Traditional Chinese (Mac OS)" = "繁體中文（Mac OS）";
"Korean (Mac OS)" = "韓文（Mac OS）";
"Arabic (Mac OS)" = "阿拉伯文（Mac OS）";
"Hebrew (Mac OS)" = "希伯來文（Mac OS）";
"Greek (Mac OS)" = "希臘文（Mac OS）";
"Cyrillic (Mac OS)" = "斯拉夫語系（Mac OS）";
"Devanagari (Mac OS)" = "梵文（Mac OS）";
"Gurmukhi (Mac OS)" = "古爾穆奇語（Mac OS）";
"Gujarati (Mac OS)" = "古吉拉特語（Mac OS）";
"Thai (Mac OS)" = "泰文（Mac OS）";
"Simplified Chinese (Mac OS)" = "簡體中文（Mac OS）";
"Tibetan (Mac OS)" = "藏文（Mac OS）";
"Central European (Mac OS)" = "中歐語系（Mac OS）";
"Symbol (Mac OS)" = "符號（Mac OS）";
"Dingbats (Mac OS)" = "Dingbats（Mac OS）";
"Turkish (Mac OS)" = "土耳其文（Mac OS）";
"Croatian (Mac OS)" = "克羅埃西亞文（Mac OS）";
"Icelandic (Mac OS)" = "冰島文（Mac OS）";
"Romanian (Mac OS)" = "羅馬尼亞文（Mac OS）";
"Celtic (Mac OS)" = "克爾特文（Mac OS）";
"Gaelic (Mac OS)" = "愛爾蘭蓋爾文（Mac OS）";
"Keyboard Symbols (Mac OS)" = "鍵盤符號（Mac OS）";
"Farsi (Mac OS)" = "波斯語（Mac OS）";
"Cyrillic (Mac OS Ukrainian)" = "斯拉夫語系（Mac OS Ukrainian）";
"Inuit (Mac OS)" = "伊紐文（Mac OS）";
"Unicode (UTF-32LE)" = "Unicode（UTF-32LE）";
"Unicode (UTF-8)" = "Unicode（UTF-8）";
"Unicode (UTF-16)" = "Unicode（UTF-16）";
"Unicode (UTF-16BE)" = "Unicode（UTF-16BE）";
"Unicode (UTF-16LE)" = "Unicode（UTF-16LE）";
"Unicode (UTF-32)" = "Unicode（UTF-32）";
"Unicode (UTF-32BE)" = "Unicode（UTF-32BE）";
"Western (ISO Latin 1)" = "西方語系（ISO Latin 1）";
"Central European (ISO Latin 2)" = "中歐語系（ISO Latin 2）";
"Western (ISO Latin 3)" = "西方語系（ISO Latin 3）";
"Central European (ISO Latin 4)" = "中歐語系（ISO Latin 4）";
"Cyrillic (ISO 8859-5)" = "斯拉夫語系（ISO 8859-5）";
"Arabic (ISO 8859-6)" = "阿拉伯文（ISO 8859-6）";
"Greek (ISO 8859-7)" = "希臘文（ISO 8859-7）";
"Hebrew (ISO 8859-8)" = "希伯來文（ISO 8859-8）";
"Turkish (ISO Latin 5)" = "土耳其文（ISO Latin 5）";
"Nordic (ISO Latin 6)" = "北日耳曼語系（ISO Latin 6）";
"Thai (ISO 8859-11)" = "泰文（ISO 8859-11）";
"Baltic Rim (ISO Latin 7)" = "環波羅的海語系（ISO Latin 7）";
"Celtic (ISO Latin 8)" = "克爾特文（ISO Latin 8）";
"Western (ISO Latin 9)" = "西方語系（ISO Latin 9）";
"Romanian (ISO Latin 10)" = "羅馬尼亞文（ISO Latin 10）";
"Latin-US (DOS)" = "Latin-US（DOS）";
"Greek (DOS)" = "希臘文（DOS）";
"Baltic Rim (DOS)" = "環波羅的海語系（DOS）";
"Western (DOS Latin 1)" = "西方語系（DOS Latin 1）";
"Greek (DOS Greek 1)" = "希臘文（DOS Greek 1）";
"Central European (DOS Latin 2)" = "中歐語系（DOS Latin 2）";
"Cyrillic (DOS)" = "斯拉夫語系（DOS）";
"Turkish (DOS)" = "土耳其文（DOS）";
"Portuguese (DOS)" = "葡萄牙文（DOS）";
"Icelandic (DOS)" = "冰島文（DOS）";
"Hebrew (DOS)" = "希伯來文（DOS）";
"Canadian French (DOS)" = "加拿大法文（DOS）";
"Arabic (DOS)" = "阿拉伯文（DOS）";
"Nordic (DOS)" = "北日耳曼語系（DOS）";
"Russian (DOS)" = "俄文（DOS）";
"Greek (DOS Greek 2)" = "希臘文（DOS Greek 2）";
"Thai (Windows, DOS)" = "泰文（Windows, DOS）";
"Japanese (Windows, DOS)" = "日文（Windows, DOS）";
"Simplified Chinese (Windows, DOS)" = "簡體中文（Windows, DOS）";
"Korean (Windows, DOS)" = "韓文（Windows, DOS）";
"Traditional Chinese (Windows, DOS)" = "繁體中文（Windows, DOS）";
"Western (Windows Latin 1)" = "西方語系（Windows Latin 1）";
"Central European (Windows Latin 2)" = "中歐語系（Windows Latin 2）";
"Cyrillic (Windows)" = "斯拉夫語系（Windows）";
"Greek (Windows)" = "希臘文（Windows）";
"Turkish (Windows Latin 5)" = "土耳其文（Windows Latin 5）";
"Hebrew (Windows)" = "希伯來文（Windows）";
"Arabic (Windows)" = "阿拉伯文（Windows）";
"Baltic Rim (Windows)" = "環波羅的海語系（Windows）";
"Vietnamese (Windows)" = "越南文（Windows）";
"Western (ASCII)" = "西方語系（ASCII）";
"Japanese (Shift JIS X0213)" = "日文（Shift JIS X0213）";
"Chinese (GBK)" = "中文（GBK）";
"Chinese (GB 18030)" = "中文（GB 18030）";
"Japanese (ISO 2022-JP)" = "日文（ISO 2022-JP）";
"Korean (ISO 2022-KR)" = "韓文（ISO 2022-KR）";
"Japanese (EUC)" = "日文（EUC）";
"Simplified Chinese (EUC)" = "簡體中文（EUC）";
"Traditional Chinese (EUC)" = "繁體中文（EUC）";
"Korean (EUC)" = "韓文（EUC）";
"Japanese (Shift JIS)" = "日文（Shift JIS）";
"Cyrillic (KOI8-R)" = "斯拉夫語系（KOI8-R）";
"Traditional Chinese (Big 5)" = "繁體中文（Big 5）";
"Western (Mac Mail)" = "西方語系（Mac Mail）";
"Simplified Chinese (HZ GB 2312)" = "簡體中文（HZ GB 2312）";
"Traditional Chinese (Big 5 HKSCS)" = "繁體中文（Big 5 HKSCS）";
"Ukrainian (KOI8-U)" = "烏克蘭文（KOI8-U）";
"Traditional Chinese (Big 5-E)" = "繁體中文（Big 5-E）";
"Western (NextStep)" = "西方語系（NextStep）";
"Non-lossy ASCII" = "無耗損 ASCII";
"Western (EBCDIC US)" = "西方語系（EBCDIC US）";
"Western (EBCDIC Latin 1)" = "西方語系（EBCDIC Latin 1）";
"Japanese (Auto Detect)" = "日文（自動偵測）";
